Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/mengzi__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 齊宣王問曰：「齊桓、晉文之事可得聞乎？」孟子對曰：「仲尼之徒，無道桓、文之事者，是以後世無傳焉；臣未之聞也。無以，則王乎？」曰：「德何如，則可以王矣？」曰：「保民而王，莫之能禦也。」曰：「若寡人者，可以保民乎哉？」曰：「可。」曰：「何由知吾可也？」曰：「臣聞之胡齕曰，王坐於堂上，有牽牛而過堂下者，王見之，曰：『牛何之？』對曰：『將以釁鐘。』王曰：『舍之！吾不忍其觳觫，若無罪而就死地。』對曰：『然則廢釁鐘與？』曰：『何可廢也？以羊易之！』不識有諸？」曰：「有之。」曰：「是心足以王矣。百姓皆以王為愛也，臣固知王之不忍也。」王曰：「然。誠有百姓者。齊國雖褊小，吾何愛一牛？即不忍其觳觫，若無罪而就死地，故以羊易之也。」曰：「王無異於百姓之以王為愛也。以小易大，彼惡知之？王若隱其無罪而就死地，則牛羊何擇焉？」王笑曰：「是誠何心哉？我非愛其財而易之以羊也。宜乎百姓之謂我愛也。」曰：「無傷也，是乃仁術也，見牛未見羊也。君子之於禽獸也，見其生，不忍見其死；聞其聲，不忍食其肉。是以君子遠庖廚也。」王說曰：「《詩》云：『他人有心，予忖度之。』夫子之謂也。夫我乃行之，反而求之，不得吾心。夫子言之，於我心有戚戚焉。此心之所以合於王者，何也？」曰：「有復於王者曰：『吾力足以舉百鈞，而不足以舉一羽；明足以察秋毫之末，而不見輿薪。』則王許之乎？」曰：「否。」「今恩足以及禽獸，而功不至於百姓者，獨何與？然則一羽之不舉，為不用力焉；輿薪之不見，為不用明焉；百姓之不見保，為不用恩焉。故王之不王，不為也，非不能也。」曰：「不為者與不能者之形，何以異？」曰：「挾太山以超北海，語人曰：『我不能。』是誠不能也。為長者折枝，語人曰：『我不能。』是不為也，非不能也。故王之不王，非挾太山以超北海之類也；王之不王，是折枝之類也。老吾老，以及人之老；幼吾幼，以及人之幼；天下可運於掌。《詩》云：『刑於寡妻，至於兄弟，以御於家邦。』言舉斯心加諸彼而已。故推恩足以保四海，不推恩無以保妻子。古之人所以大過人者，無他焉，善推其所為而已矣。今恩足以及禽獸，而功不至於百姓者，獨何與？權，然後知輕重；度，然後知長短。物皆然，心為甚。王請度之。抑王興甲兵，危士臣，構怨於諸侯，然後快於心與？」王曰：「否。吾何快於是？將以求吾所大欲也。」曰：「王之所大欲，可得聞與？」王笑而不言。曰：「為肥甘不足於口與？輕暖不足於體與？抑為采色不足視於目與？聲音不足聽於耳與？便嬖不足使令於前與？王之諸臣，皆足以供之；而王豈為是哉？」曰：「否。吾不為是也。」曰：「然則王之大欲，可知已：欲闢土地，朝秦楚，蒞中國而撫四夷也。以若所為，求若所欲，猶緣木而求魚也。」王曰：「若是其甚與？」曰：「殆有甚焉。緣木求魚，雖不得魚，無後災；以若所為，求若所欲，盡心力而為之，後必有災。」曰：「可得聞與？」曰：「鄒人與楚人戰，則王以為孰勝？」曰：「楚人勝。」曰：「然則小固不可以敵大，寡固不可以敵眾，弱固不可以敵強。海內之地，方千里者九，齊集有其一；以一服八，何以異於鄒敵楚哉？蓋亦反其本矣。今王發政施仁，使天下仕者皆欲立於王之朝，耕者皆欲耕於王之野，商賈皆欲藏於王之市，行旅皆欲出於王之途，天下之欲疾其君者皆欲赴愬於王。其若是，孰能御之？」王曰：「吾惛，不能進於是矣。願夫子輔吾志，明以教我。我雖不敏，請嘗試之。」曰：「無恆產而有恆心者，惟士為能。若民，則無恆產，因無恆心。苟無恆心，放辟邪侈，無不為已。及陷於罪，然後從而刑之，是罔民也。焉有仁人在位，罔民而可為也？是故明君制民之產，必使仰足以事父母，俯足以畜妻子；樂歲終身飽，凶年免於死亡；然後驅而之善，故民之從之也輕。今之制民之產，仰不足以事父母，俯不足以畜妻子；樂歲終身苦，凶年不免於死亡；此惟救死而恐不贍，奚暇治禮義哉？王欲行之，則盍反其本矣：五畝之宅，樹之以桑，五十者可以衣帛矣；雞豚狗彘之畜，無失其時，七十者可以食肉矣；百畝之田，勿奪其時，八口之家可以無饑矣；謹庠序之教，申之以孝悌之義，頒白者不負戴於道路矣。老者衣帛食肉，黎民不饑不寒，然而不王者，未之有也。」
en: The king Xuan of Qi asked, saying, 'May I be informed by you of the transactions of Huan of Qi, and Wen of Jin?' Mencius replied, 'There were none of the disciples of Zhong Ni who spoke about the affairs of Huan and Wen, and therefore they have not been transmitted to these after-ages - your servant has not heard them. If you will have me speak, let it be about royal government.' The king said, 'What virtue must there be in order to attain to royal sway?' Mencius answered, 'The love and protection of the people; with this there is no power which can prevent a ruler from attaining to it.' The king asked again, 'Is such an one as I competent to love and protect the people?' Mencius said, 'Yes.' 'How do you know that I am competent for that?' 'I heard the following incident from Hu He: "The king," said he, "was sitting aloft in the hall, when a man appeared, leading an ox past the lower part of it. The king saw him, and asked, Where is the ox going? The man replied, We are going to consecrate a bell with its blood. The king said, Let it go. I cannot bear its frightened appearance, as if it were an innocent person going to the place of death. The man answered, Shall we then omit the consecration of the bell ? The king said, How can that be omitted? Change it for a sheep." I do not know whether this incident really occurred.' The king replied, 'It did,' and then Mencius said, 'The heart seen in this is sufficient to carry you to the royal sway. The people all supposed that your Majesty grudged the animal, but your servant knows surely, that it was your Majesty's not being able to bear the sight, which made you do as you did.' The king said, 'You are right. And yet there really was an appearance of what the people condemned. But though Qi be a small and narrow State, how should I grudge one ox? Indeed it was because I could not bear its frightened appearance, as if it were an innocent person going to the place of death, that therefore I changed it for a sheep.' Mencius pursued, 'Let not your Majesty deem it strange that the people should think you were grudging the animal. When you changed a large one for a small, how should they know the true reason? If you felt pained by its being led without guilt to the place of death, what was there to choose between an ox and a sheep? The king laughed and said, 'What really was my mind in the matter? I did not grudge the expense of it, and changed it for a sheep! There was reason in the people's saying that I grudged it.' 'There is no harm in their saying so,' said Mencius. 'Your conduct was an artifice of benevolence. You saw the ox, and had not seen the sheep. So is the superior man affected towards animals, that, having seen them alive, he cannot bear to see them die; having heard their dying cries, he cannot bear to eat their flesh. Therefore he keeps away from his slaughter-house and cook-room.' The king was pleased, and said, 'It is said in the Book of Poetry, "The minds of others, I am able by reflection to measure;" - this is verified, my Master, in your discovery of my motive. I indeed did the thing, but when I turned my thoughts inward, and examined into it, I could not discover my own mind. When you, Master, spoke those words, the movements of compassion began to work in my mind. How is it that this heart has in it what is equal to the royal sway?' Mencius replied, 'Suppose a man were to make this statement to your Majesty: "My strength is sufficient to lift three thousand catties, but it is not sufficient to lift one feather; my eyesight is sharp enough to examine the point of an autumn hair, but I do not see a waggon-load of faggots;" would your Majesty allow what he said?' 'No,' was the answer, on which Mencius proceeded, 'Now here is kindness sufficient to reach to animals, and no benefits are extended from it to the people. How is this? Is an exception to be made here? The truth is, the feather is not lifted , because strength is not used; the waggon-load of firewood is not seen, because the eyesight is not used; and the people are not loved and protected, because kindness is not employed. Therefore your Majesty's not exercising the royal sway, is because you do not do it, not because you are not able to do it.' The king asked, 'How may the difference between the not doing a thing, and the not being able to do it, be represented? Mencius replied,'In such a thing as taking the Tai mountain under your arm, and leaping over the north sea with it, if you say to people "I am not able to do it," that is a real case of not being able. In such a matter as breaking off a branch from a tree at the order of a superior, if you say to people "I am not able to do it," that is a case of not doing it, it is not a case of not being able to do it. Therefore your Majesty's not exercising the royal sway, is not such a case as that of taking the Tai mountain under your arm, and leaping over the north sea with it. Your Majesty's not exercising the royal sway is a case like that of breaking off a branch from a tree. Treat with the reverence due to age the elders in your own family, so that the elders in the families of others shall be similarly treated; treat with the kindness due to youth the young in your own family, so that the young in the families of others shall be similarly treated - do this, and the kingdom may be made to go round in your palm. It is said in the Book of Poetry, "His example affected his wife. It reached to his brothers, and his family of the State was governed by it." The language shows how king Wen simply took his kindly heart, and exercised it towards those parties. Therefore the carrying out his kindness of heart by a prince will suffice for the love and protection of all within the four seas, and if he do not carry it out, he will not be able to protect his wife and children. The way in which the ancients came greatly to surpass other men, was no other but this - simply that they knew well how to carry out, so as to affect others, what they themselves did. Now your kindness is sufficient to reach to animals, and no benefits are extended from it to reach the people. How is this? Is an exception to be made here? By weighing, we know what things are light, and what heavy. By measuring, we know what things are long, and what short. The relations of all things may be thus determined, and it is of the greatest importance to estimate the motions of the mind. I beg your Majesty to measure it. You collect your equipments of war, endanger your soldiers and officers, and excite the resentment of the other princes - do these things cause you pleasure in your mind?' The king replied, 'No. How should I derive pleasure from these things? My object in them is to seek for what I greatly desire.' Mencius said, 'May I hear from you what it is that you greatly desire?' The king laughed and did not speak. Mencius resumed, 'Are you led to desire it, because you have not enough of rich and sweet food for your mouth? Or because you have not enough of light and warm clothing for your body? Or because you have not enough of beautifully coloured objects to delight your eyes? Or because you have not voices and tones enough to please your ears? Or because you have not enough of attendants and favourites to stand before you and receive your orders? Your Majesty's various officers are sufficient to supply you with those things. How can your Majesty be led to entertain such a desire on account of them?' 'No,' said the king; 'my desire is not on account of them.' Mencius added, 'Then, what your Majesty greatly desires may be known. You wish to enlarge your territories, to have Qin and Chu wait at your court, to rule the Middle Kingdom, and to attract to you the barbarous tribes that surround it. But doing what you do to seek for what you desire is like climbing a tree to seek for fish.' The king said, 'Is it so bad as that?' 'It is even worse,' was the reply. 'If you climb a tree to seek for fish, although you do not get the fish, you will not suffer any subsequent calamity. But doing what you do to seek for what you desire, doing it moreover with all your heart, you will assuredly afterwards meet with calamities.' The king asked, 'May I hear from you the proof of that?' Mencius said, 'If the people of Zou should fight with the people of Chu, which of them does your Majesty think would conquer?' 'The people of Chu would conquer.' 'Yes - and so it is certain that a small country cannot contend with a great, that few cannot contend with many, that the weak cannot contend with the strong. The territory within the four seas embraces nine divisions, each of a thousand li square. All Qi together is but one of them. If with one part you try to subdue the other eight, what is the difference between that and Zou's contending with Chu? For, with such a desire, you must turn back to the proper course for its attainment. Now if your Majesty will institute a government whose action shall be benevolent, this will cause all the officers in the kingdom to wish to stand in your Majesty's court, and all the farmers to wish to plough in your Majesty's fields, and all the merchants, both travelling and stationary, to wish to store their goods in your Majesty's market-places, and all travelling strangers to wish to make their tours on your Majesty's roads, and all throughout the kingdom who feel aggrieved by their rulers to wish to come and complain to your Majesty. And when they are so bent, who will be able to keep them back?' The king said, 'I am stupid, and not able to advance to this. I wish you, my Master, to assist my intentions. Teach me clearly; although I am deficient in intelligence and vigour, I will essay and try to carry your instructions into effect.' Mencius replied, 'They are only men of education, who, without a certain livelihood, are able to maintain a fixed heart. As to the people, if they have not a certain livelihood, it follows that they will not have a fixed heart. And if they have not a fixed heart, there is nothing which they will not do, in the way of self-abandonment, of moral deflection, of depravity, and of wild license. When they thus have been involved in crime, to follow them up and punish them - this is to entrap the people. How can such a thing as entrapping the people be done under the rule of a benevolent man? Therefore an intelligent ruler will regulate the livelihood of the people, so as to make sure that, for those above them, they shall have sufficient wherewith to serve their parents, and, for those below them, sufficient wherewith to support their wives and children; that in good years they shall always be abundantly satisfied, and that in bad years they shall escape the danger of perishing. After this he may urge them, and they will proceed to what is good, for in this case the people will follow after it with ease. Now, the livelihood of the people is so regulated, that, above, they have not sufficient wherewith to serve their parents, and, below, they have not sufficient wherewith to support their wives and children. Notwithstanding good years, their lives are continually embittered, and, in bad years, they do not escape perishing. In such circumstances they only try to save themselves from death, and are afraid they will not succeed. What leisure have they to cultivate propriety and righteousness? If your Majesty wishes to effect this regulation of the livelihood of the people, why not turn to that which is the essential step to it? Let mulberry-trees be planted about the homesteads with their five mu, and persons of fifty years may be clothed with silk. In keeping fowls, pigs, dogs, and swine, let not their times of breeding be neglected, and persons of seventy years may eat flesh. Let there not be taken away the time that is proper for the cultivation of the farm with its hundred mu, and the family of eight mouths that is supported by it shall not suffer from hunger. Let careful attention be paid to education in schools, the inculcation in it especially of the filial and fraternal duties, and grey-haired men will not be seen upon the roads, carrying burdens on their backs or on their heads. It never has been that the ruler of a State where such results were seen, the old wearing silk and eating flesh, and the black-haired people suffering neither from hunger nor cold, did not attain to the royal dignity.'

source: 莊暴見孟子，曰：「暴見於王，王語暴以好樂，暴未有以對也。」曰：「好樂何如？」孟子曰：「王之好樂甚，則齊國其庶幾乎!」他日見於王，曰：「王嘗語莊子以好樂，有諸？」王變乎色，曰：「寡人非能好先王之樂也，直好世俗之樂耳。」曰：「王之好樂甚，則齊其庶幾乎！今之樂，猶古之樂也。」曰：「可得聞與？」曰：「獨樂樂，與人樂樂，孰樂？」曰：「不若與人。」曰：「與少樂樂，與眾樂樂，孰樂？」曰：「不若與眾。」「臣請為王言樂。今王鼓樂於此，百姓聞王鐘鼓之聲，管龠之音，舉疾首蹙頞而相告曰：『吾王之好鼓樂，夫何使我至於此極也？父子不相見，兄弟妻子離散。』今王田獵於此，百姓聞王車馬之音，見羽旄之美，舉疾首蹙頞而相告曰：『吾王之好田獵，夫何使我至於此極也？父子不相見，兄弟妻子離散。』此無他，不與民同樂也。今王鼓樂於此，百姓聞王鐘鼓之聲，管龠之音，舉欣欣然有喜色而相告曰：『吾王庶幾無疾病與，何以能鼓樂也？』今王田獵於此，百姓聞王車馬之音，見羽旄之美，舉欣欣然有喜色而相告曰：『吾王庶幾無疾病與，何以能田獵也？』此無他，與民同樂也。今王與百姓同樂，則王矣。」
en: Zhuang Bao, seeing Mencius, said to him, 'I had an interview with the king. His Majesty told me that he loved music, and I was not prepared with anything to reply to him. What do you pronounce about that love of music?' Mencius replied, 'If the king's love of music were very great, the kingdom of Qi would be near to a state of good government!' Another day, Mencius, having an interview with the king, said, 'Your Majesty, I have heard, told the officer Zhuang, that you love music - was it so?' The king changed colour, and said, 'I am unable to love the music of the ancient sovereigns; I only love the music that suits the manners of the present age.' Mencius said, 'If your Majesty's love of music were very great, Qi would be near to a state of good government! The music of the present day is just like the music of antiquity, as regards effecting that.' The king said, 'May I hear from you the proof of that?' Mencius asked, 'Which is the more pleasant - to enjoy music by yourself alone, or to enjoy it with others?' 'To enjoy it with others,' was the reply. 'And which is the more pleasant - to enjoy music with a few, or to enjoy it with many?' 'To enjoy it with many.' Mencius proceeded, 'Your servant begs to explain what I have said about music to your Majesty. Now, your Majesty is having music here. The people hear the noise of your bells and drums, and the notes of your fifes and pipes, and they all, with aching heads, knit their brows, and say to one another, "That's how our king likes his music! But why does he reduce us to this extremity of distress? Fathers and sons cannot see one another. Elder brothers and younger brothers, wives and children, are separated and scattered abroad." Now, your Majesty is hunting here. The people hear the noise of your carriages and horses, and see the beauty of your plumes and streamers, and they all, with aching heads, knit their brows, and say to one another, "That's how our king likes his hunting! But why does he reduce us to this extremity of distress? Fathers and sons cannot see one another. Elder brothers and younger brothers, wives and children, are separated and scattered abroad." Their feeling thus is from no other reason but that you do not allow the people to have pleasure as well as yourself. 'Now, your Majesty is having music here. The people hear the noise of your bells and drums, and the notes of your fifes and pipes, and they all, delighted, and with joyful looks, say to one another, "That sounds as if our king were free from all sickness! If he were not, how could he enjoy this music?" Now, your Majesty is hunting here. The people hear the noise of your carriages and horses, and see the beauty of your plumes and streamers, and they all, delighted, and with joyful looks, say to one another, "That looks as if our king were free from all sickness! If he were not, how could he enjoy this hunting?" Their feeling thus is from no other reason but that you cause them to have their pleasure as you have yours. If your Majesty now will make pleasure a thing common to the people and yourself, the royal sway awaits you.'

source: 齊宣王問曰：「文王之囿方七十里，有諸？」孟子對曰：「於傳有之。」曰：「若是其大乎？」曰：「民猶以為小也。」曰：「寡人之囿方四十里，民猶以為大，何也？」曰：「文王之囿方七十里，芻蕘者往焉，雉兔者往焉，與民同之。民以為小，不亦宜乎？臣始至於境，問國之大禁，然後敢入。臣聞郊關之內有囿方四十里，殺其麋鹿者如殺人之罪，則是方四十里為阱於國中。民以為大，不亦宜乎？」
en: The king Xuan of Qi asked, 'Was it so, that the park of king Wen contained seventy square li?' Mencius replied, 'It is so in the records.' 'Was it so large as that?' exclaimed the king. 'The people,' said Mencius, 'still looked on it as small.' The king added, 'My park contains only forty square li, and the people still look on it as large. How is this?' 'The park of king Wen,' was the reply, 'contained seventy square li, but the grass-cutters and fuel-gatherers had the privilege of entrance into it; so also had the catchers of pheasants and hares. He shared it with the people, and was it not with reason that they looked on it as small? When I first arrived at the borders of your kingdom, I inquired about the great prohibitory regulations, before I would venture to enter it; and I heard, that inside the barrier-gates there was a park of forty square lî, and that he who killed a deer in it, was held guilty of the same crime as if he had killed a man. Thus those forty square li are a pitfall in the middle of the kingdom. Is it not with reason that the people look upon them as large?'

source: 齊宣王問曰：「交鄰國有道乎？」孟子對曰：「有。惟仁者為能以大事小，是故湯事葛，文王事昆夷。惟智者為能以小事大，故太王事獯鬻，勾踐事吳。以大事小者，樂天者也；以小事大者，畏天者也。樂天者，保天下；畏天者，保其國。《詩》云：『畏天之威，於時保之。』」王曰：「大哉言矣！寡人有疾，寡人好勇。」對曰：「王請無好小勇。夫撫劍疾視曰：『彼惡敢當我哉！』此匹夫之勇，敵一人者也。王請大之！《詩》云：『王赫斯怒，爰整其旅，以遏徂莒，以篤周祜，以對於天下。』此文王之勇也。文王一怒而安天下之民。《書》曰：『天降下民，作之君，作之師，惟曰：其助上帝，寵之四方。有罪無罪，惟我在，天下曷敢有越厥志？』一人衡行於天下，武王恥之，此武王之勇也。而武王亦一怒而安天下之民。今王亦一怒而安天下之民，民惟恐王之不好勇也。」
en: The king Xuan of Qi asked, saying, 'Is there any way to regulate one's maintenance of intercourse with neighbouring kingdoms?' Mencius replied, 'There is. But it requires a perfectly virtuous prince to be able, with a great country, to serve a small one - as, for instance, Tang served Ge, and king Wen served the Kun barbarians. And it requires a wise prince to be able, with a small country, to serve a large one - as the king Tai served the Xun Yu, and Gou Jian served Wu. He who with a areat State serves a small one, delights in Heaven. He who with a small State serves a large one, stands in awe of Heaven. He who delights in Heaven, will affect with his love and protection the whole kingdom. He who stands in awe of Heaven, will affect with his love and protection his own kingdom. It is said in the Book of Poetry, "I fear the Majesty of Heaven, and will thus preserve its favouring decree."' The king said,'A great saying! But I have an infirmity - I love valour.' I beg your Majesty,' was the reply, 'not to love small valour. If a man brandishes his sword, looks fiercely, and says, "How dare he withstand me?" - this is the valour of a common man, who can be the opponent only of a single individual. I beg your Majesty to greaten it. It is said in the Book of Poetry, "The king blazed with anger, And he marshalled his hosts, To stop the march to Chu, To consolidate the prosperity of Zhou, To meet the expectations of the nation." This was the valour of king Wen. King Wen, in one burst of his anger, gave repose to all the people of the kingdom. In the Book of History it is said, "Heaven having produced the inferior people, made for them rulers and teachers, with the purpose that they should be assisting to God, and therefore distinguished them throughout the four quarters of the land. Whoever are offenders, and whoever are innocent, here am I to deal with them. How dare any under heaven give indulgence to their refractory wills?" There was one man pursuing a violent and disorderly course in the kingdom, and king Wu was ashamed of it. This was the valour of king Wu. He also, by one display of his anger, gave repose to all the people of the kingdom. Let now your Majesty also, in one burst of anger, give repose to all the people of the kingdom. The people are only afraid that your Majesty does not love valour.'
